---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarShape.GetCurvesForBrowser
source: html/d07fdab5-5af9-a9e6-3840-d3a4b52d6979.htm
---
# Autodesk.Revit.DB.Structure.RebarShape.GetCurvesForBrowser Method

Generate curves for the shape, as used in the shape browser.

## Syntax (C#)
```csharp
public IList<Curve> GetCurvesForBrowser()
```

## Returns
An array of curves representing the shape with its default parameters.